platformio/platform-ststm32/misc/svd/STM32L476.svd
            <register>
               <name>IOG4CR</name>
               <displayName>IOG4CR</displayName>
               <description>I/O group x counter register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOG5CR</name>
               <displayName>IOG5CR</displayName>
               <description>I/O group x counter register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOG6CR</name>
               <displayName>IOG6CR</displayName>
               <description>I/O group x counter register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOG7CR</name>
               <displayName>IOG7CR</displayName>
               <description>I/O group x counter register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOG8CR</name>
               <displayName>IOG8CR</displayName>
               <description>I/O group x counter register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>IWDG</name>
         <description>Independent watchdog</description>
         <groupName>IWDG</groupName>
         <baseAddress>0x40003000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>KR</name>
               <displayName>KR</displayName>
               <description>Key register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Key value (write only, read               0x0000)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PR</name>
               <displayName>PR</displayName>
               <description>Prescaler register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PR</name>
                     <description>Prescaler divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLR</name>
               <displayName>RLR</displayName>
               <description>Reload register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>RL</name>
                     <description>Watchdog counter reload               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WVU</name>
                     <description>Watchdog counter window value               update</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RVU</name>
                     <description>Watchdog counter reload value               update</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVU</name>
                     <description>Watchdog prescaler value               update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINR</name>
               <displayName>WINR</displayName>
               <description>Window register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000FFF</resetValue>
               <fields>
                  <field>
                     <name>WIN</name>
                     <description>Watchdog counter window               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
